SinhㅤNhậtㅤVuiㅤVẻ = __import__('builtins').chr
_17ㅤYearㅤOld = __import__('builtins').ord
___ㅤ___ㅤ____ㅤ_ㅤㅤ = 0
while ___ㅤ___ㅤ____ㅤ_ㅤㅤ != 2:
    ___ㅤ___ㅤ____ㅤ_ㅤㅤ += 1
    try:
        raise getattr(
            __builtins__,
            "".join(
                [
                    ValueError.__name__[0],
                    IndentationError.__name__[6],
                    UnboundLocalError.__name__[11],
                    ExceptionGroup.__name__[12],
                    BufferError.__name__[4],
                    FloatingPointError.__name__[13],
                    EOFError.__name__[4],
                    ConnectionRefusedError.__name__[18],
                    PermissionError.__name__[8],
                    ConnectionAbortedError.__name__[13],
                ]
            ),
        )(___ㅤ___ㅤ____ㅤ_ㅤㅤ)
    except ValueError as ㅤ_ㅤㅤㅤ___ㅤㅤㅤ_ㅤ___:
        if ㅤ_ㅤㅤㅤ___ㅤㅤㅤ_ㅤ___.args[0] == 1:
            __ᅠᅠᅠᅠ_ᅠᅠ__ᅠ___ᅠ = 76770430
_ㅤ_ㅤㅤㅤㅤㅤ_ㅤㅤ_ㅤ_ㅤ_ = 0
while _ㅤ_ㅤㅤㅤㅤㅤ_ㅤㅤ_ㅤ_ㅤ_ != 2:
    _ㅤ_ㅤㅤㅤㅤㅤ_ㅤㅤ_ㅤ_ㅤ_ += 1
    try:
        raise getattr(
            __builtins__,
            "".join(
                [
                    ValueError.__name__[0],
                    IndentationError.__name__[6],
                    NotImplementedError.__name__[6],
                    ModuleNotFoundError.__name__[3],
                    ReferenceError.__name__[1],
                    SystemError.__name__[6],
                    BaseExceptionGroup.__name__[14],
                    UnicodeDecodeError.__name__[14],
                    MemoryError.__name__[3],
                    IndentationError.__name__[12],
                ]
            ),
        )(_ㅤ_ㅤㅤㅤㅤㅤ_ㅤㅤ_ㅤ_ㅤ_)
    except ValueError as _ㅤ___ㅤㅤ_ㅤ__ㅤㅤ_ㅤ_:
        if _ㅤ___ㅤㅤ_ㅤ__ㅤㅤ_ㅤ_.args[0] == 1:
            _ㅤㅤㅤㅤ_ㅤㅤㅤㅤ__ㅤ___ = [
                660918103,
                514272507,
                562781013,
                390066264,
                842353730,
                1286329140,
                317133610,
                697167637,
                133778592,
                1488597265,
                186263329,
                511039068,
            ]
_ㅤㅤㅤㅤ_ㅤㅤㅤㅤ__ㅤ___[76770422 ^ __ᅠᅠᅠᅠ_ᅠᅠ__ᅠ___ᅠ] = (
    _ㅤㅤㅤㅤ_ㅤㅤㅤㅤ__ㅤ___[76770422 ^ __ᅠᅠᅠᅠ_ᅠᅠ__ᅠ___ᅠ] ^ ~-194405548
)
_ㅤㅤㅤㅤ_ㅤㅤㅤㅤ__ㅤ___[76770422 ^ __ᅠᅠᅠᅠ_ᅠᅠ__ᅠ___ᅠ] = (
    _ㅤㅤㅤㅤ_ㅤㅤㅤㅤ__ㅤ___[76770422 ^ __ᅠᅠᅠᅠ_ᅠᅠ__ᅠ___ᅠ] ^ ~-86962001
)
_ㅤㅤㅤㅤ_ㅤㅤㅤㅤ__ㅤ___[76770422 ^ __ᅠᅠᅠᅠ_ᅠᅠ__ᅠ___ᅠ] = (
    _ㅤㅤㅤㅤ_ㅤㅤㅤㅤ__ㅤ___[76770422 ^ __ᅠᅠᅠᅠ_ᅠᅠ__ᅠ___ᅠ] ^ ~-31486660
)
_ㅤㅤㅤㅤ_ㅤㅤㅤㅤ__ㅤ___[76770422 ^ __ᅠᅠᅠᅠ_ᅠᅠ__ᅠ___ᅠ] = (
    _ㅤㅤㅤㅤ_ㅤㅤㅤㅤ__ㅤ___[76770422 ^ __ᅠᅠᅠᅠ_ᅠᅠ__ᅠ___ᅠ] ^ ~-129946681
)
_ㅤㅤㅤㅤ_ㅤㅤㅤㅤ__ㅤ___[76770422 ^ __ᅠᅠᅠᅠ_ᅠᅠ__ᅠ___ᅠ] = (
    _ㅤㅤㅤㅤ_ㅤㅤㅤㅤ__ㅤ___[76770422 ^ __ᅠᅠᅠᅠ_ᅠᅠ__ᅠ___ᅠ] ^ ~-42244998
)
_ㅤㅤㅤㅤ_ㅤㅤㅤㅤ__ㅤ___[76770422 ^ __ᅠᅠᅠᅠ_ᅠᅠ__ᅠ___ᅠ] = (
    _ㅤㅤㅤㅤ_ㅤㅤㅤㅤ__ㅤ___[76770422 ^ __ᅠᅠᅠᅠ_ᅠᅠ__ᅠ___ᅠ] ^ ~-123230597
)
_ㅤㅤㅤㅤ_ㅤㅤㅤㅤ__ㅤ___[76770422 ^ __ᅠᅠᅠᅠ_ᅠᅠ__ᅠ___ᅠ] = (
    _ㅤㅤㅤㅤ_ㅤㅤㅤㅤ__ㅤ___[76770422 ^ __ᅠᅠᅠᅠ_ᅠᅠ__ᅠ___ᅠ] ^ ~-180593570
)
__ᅠᅠᅠᅠ_ᅠᅠ__ᅠ___ᅠ = _ㅤㅤㅤㅤ_ㅤㅤㅤㅤ__ㅤ___[76770422 ^ __ᅠᅠᅠᅠ_ᅠᅠ__ᅠ___ᅠ]
while __ᅠᅠᅠᅠ_ᅠᅠ__ᅠ___ᅠ != (lambda _ㅤㅤ_ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_ㅤ: _ㅤㅤ_ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_ㅤ())(
    lambda: -13805166480
    ^ 26786274106
    ^ -30961796721
    ^ -22863915590
    ^ 19226312485
    ^ -64933420509
    ^ -67270992575
    ^ -15635753158
):
    __ᅠᅠᅠᅠ_ᅠᅠ__ᅠ___ᅠ += (lambda _ㅤㅤㅤㅤㅤㅤ_ㅤㅤ_ㅤ____: _ㅤㅤㅤㅤㅤㅤ_ㅤㅤ_ㅤ____())(
        lambda: 34225896231
        ^ -11083631202
        ^ 17987794790
        ^ -27898548658
        ^ 67987812594
        ^ -18731986151
        ^ -55604338476
        ^ 1489278127
    )
    try:
        raise getattr(
            __builtins__,
            (lambda ㅤ_ㅤㅤㅤㅤㅤ_ㅤㅤㅤ__ㅤ_ㅤ: "".join([]))('\x16+\x17\x16\x10"').join(
                [
                    ValueError.__name__[
                        (lambda ㅤㅤㅤㅤ__ㅤ_ㅤ__ㅤ___ㅤ: ㅤㅤㅤㅤ__ㅤ_ㅤ__ㅤ___ㅤ())(
                            lambda: -35820242731
                            ^ -7551911046
                            ^ -34645626566
                            ^ -23890205087
                            ^ -32112180241
                            ^ 26833192353
                            ^ -63048272179
                            ^ 51057517687
                        )
                    ],
                    ValueError.__name__[
                        (lambda ㅤㅤ__ㅤ_ㅤ___ㅤㅤ_ㅤㅤㅤ: ㅤㅤ__ㅤ_ㅤ___ㅤㅤ_ㅤㅤㅤ())(
                            lambda: 37158326944
                            ^ -16429820383
                            ^ -27898584777
                            ^ 9014186355
                            ^ 28752231081
                            ^ 10494777325
                            ^ 46781085083
                            ^ 5204880411
                        )
                    ],
                    UnicodeTranslateError.__name__[
                        (lambda ㅤ_ㅤㅤ____ㅤ_ㅤㅤㅤㅤ__: ㅤ_ㅤㅤ____ㅤ_ㅤㅤㅤㅤ__())(
                            lambda: 59183435870
                            ^ 11476668812
                            ^ 11454991533
                            ^ 14628008914
                            ^ -62091412853
                            ^ -11302329012
                            ^ 42130218296
                            ^ 50411830366
                        )
                    ],
                    ValueError.__name__[
                        (lambda ㅤㅤ__ㅤㅤ____ㅤㅤ_ㅤ_ㅤ: ㅤㅤ__ㅤㅤ____ㅤㅤ_ㅤ_ㅤ())(
                            lambda: 38210648371
                            ^ -22688877498
                            ^ 2228449393
                            ^ 35261671314
                            ^ -46652723050
                            ^ 22116068766
                            ^ 5495678478
                            ^ 49959723411
                        )
                    ],
                    PermissionError.__name__[
                        (lambda ㅤㅤㅤㅤ_ㅤ_ㅤ_ㅤㅤㅤㅤㅤㅤㅤ: ㅤㅤㅤㅤ_ㅤ_ㅤ_ㅤㅤㅤㅤㅤㅤㅤ())(
                            lambda: 25941181419
                            ^ -10012059455
                            ^ -57900882440
                            ^ 7335089597
                            ^ -23428743920
                            ^ -16737527432
                            ^ 55439362409
                            ^ 12504041071
                        )
                    ],
                    FloatingPointError.__name__[
                        (lambda ㅤㅤ_ㅤㅤ_ㅤㅤㅤ_ㅤㅤㅤㅤㅤㅤ: ㅤㅤ_ㅤㅤ_ㅤㅤㅤ_ㅤㅤㅤㅤㅤㅤ())(
                            lambda: 61978417024
                            ^ 21367522893
                            ^ -39289518389
                            ^ 43407731330
                            ^ 19158115619
                            ^ 26389178746
                            ^ -39549158029
                            ^ 12035624099
                        )
                    ],
                    BlockingIOError.__name__[
                        (lambda _ㅤㅤㅤㅤㅤㅤ__ㅤㅤㅤ_ㅤ__: _ㅤㅤㅤㅤㅤㅤ__ㅤㅤㅤ_ㅤ__())(
                            lambda: -38551171894
                            ^ 53824037065
                            ^ -50205909046
                            ^ -32788127998
                            ^ 28670747366
                            ^ 52220992809
                            ^ -56815076632
                            ^ 68135119335
                        )
                    ],
                    UnicodeTranslateError.__name__[
                        (lambda _ㅤ_ㅤㅤ___ㅤㅤ_ㅤㅤ___: _ㅤ_ㅤㅤ___ㅤㅤ_ㅤㅤ___())(
                            lambda: -8525983211
                            ^ -50576613998
                            ^ -15952871438
                            ^ 56820430434
                            ^ 12207958212
                            ^ 27741504669
                            ^ 21278129776
                            ^ -20951837642
                        )
                    ],
                    Exception.__name__[
                        (lambda ㅤㅤ___ㅤㅤ_ㅤㅤ___ㅤ__: ㅤㅤ___ㅤㅤ_ㅤㅤ___ㅤ__())(
                            lambda: -16347301718
                            ^ -64669844297
                            ^ 51061867370
                            ^ -14122043689
                            ^ 31012499699
                            ^ -44952779618
                            ^ -61103336631
                            ^ -30598998397
                        )
                    ],
                    InterruptedError.__name__[
                        (lambda __ㅤ_ㅤㅤ_ㅤ__ㅤ_ㅤㅤㅤㅤ: __ㅤ_ㅤㅤ_ㅤ__ㅤ_ㅤㅤㅤㅤ())(
                            lambda: -27486002575
                            ^ -21783027402
                            ^ -40771978017
                            ^ 20048436965
                            ^ -64552672250
                            ^ -44343846820
                            ^ -65591784312
                            ^ 20165530027
                        )
                    ],
                ]
            ),
        )(__ᅠᅠᅠᅠ_ᅠᅠ__ᅠ___ᅠ)
    except ValueError as _ᅠᅠᅠᅠ_ᅠ_ᅠᅠᅠ_ᅠ_ᅠ_:
        if _ᅠᅠᅠᅠ_ᅠ_ᅠᅠᅠ_ᅠ_ᅠ_.args[
            (lambda ㅤㅤㅤ_ㅤㅤㅤ__ㅤㅤㅤㅤㅤㅤ_: ㅤㅤㅤ_ㅤㅤㅤ__ㅤㅤㅤㅤㅤㅤ_())(
                lambda: -19465647943
                ^ 55898953178
                ^ -4297983604
                ^ -33141335681
                ^ -49596980163
                ^ -18174928270
                ^ 5228876489
                ^ -7456829162
            )
        ] == (lambda _ㅤㅤ____ㅤㅤ_ㅤ_ㅤㅤ__: _ㅤㅤ____ㅤㅤ_ㅤ_ㅤㅤ__())(
            lambda: -37624918433
            ^ -42762158772
            ^ -28975992412
            ^ -26635161805
            ^ 73064725
            ^ -61643425381
            ^ 19598660651
            ^ -49200209630
        ):
            _ㅤ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤㅤ = 0
            while _ㅤ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤㅤ != 4:
                _ㅤ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤㅤ += 1
                try:
                    raise getattr(
                        __builtins__,
                        "".join(
                            [
                                ValueError.__name__[0],
                                UnboundLocalError.__name__[10],
                                FileNotFoundError.__name__[2],
                                FileNotFoundError.__name__[9],
                                ConnectionRefusedError.__name__[4],
                                NotImplementedError.__name__[14],
                                UnicodeDecodeError.__name__[14],
                                MemoryError.__name__[4],
                                IndentationError.__name__[9],
                                TypeError.__name__[5],
                            ]
                        ),
                    )(_ㅤ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤㅤ)
                except ValueError as ㅤㅤ_ㅤ____ㅤ__ㅤㅤ___:
                    if ㅤㅤ_ㅤ____ㅤ__ㅤㅤ___.args[0] == 5:
                        ㅤㅤ_ㅤ_ㅤㅤㅤ___ㅤㅤㅤㅤ_ = 106984350722985
                    if ㅤㅤ_ㅤ____ㅤ__ㅤㅤ___.args[0] == 6:
                        _ㅤㅤㅤ_____ㅤㅤㅤㅤㅤ__ = 9685373139300
                    if ㅤㅤ_ㅤ____ㅤ__ㅤㅤ___.args[0] == 7:
                        ㅤ____ㅤ___ㅤ__ㅤ_ㅤㅤ = 104513919717062
                    if ㅤㅤ_ㅤ____ㅤ__ㅤㅤ___.args[0] == 3:
                        ㅤ_____ㅤㅤㅤ_ㅤ___ㅤㅤ[182703688 ^ ___ᅠᅠᅠ_ᅠ___ᅠᅠ_ᅠᅠ] = (
                            ㅤ_____ㅤㅤㅤ_ㅤ___ㅤㅤ[182703688 ^ ___ᅠᅠᅠ_ᅠ___ᅠᅠ_ᅠᅠ] ^ ~-58843448
                        )
                        ㅤ_____ㅤㅤㅤ_ㅤ___ㅤㅤ[182703688 ^ ___ᅠᅠᅠ_ᅠ___ᅠᅠ_ᅠᅠ] = (
                            ㅤ_____ㅤㅤㅤ_ㅤ___ㅤㅤ[182703688 ^ ___ᅠᅠᅠ_ᅠ___ᅠᅠ_ᅠᅠ] ^ ~-261958233
                        )
                        ㅤ_____ㅤㅤㅤ_ㅤ___ㅤㅤ[182703688 ^ ___ᅠᅠᅠ_ᅠ___ᅠᅠ_ᅠᅠ] = (
                            ㅤ_____ㅤㅤㅤ_ㅤ___ㅤㅤ[182703688 ^ ___ᅠᅠᅠ_ᅠ___ᅠᅠ_ᅠᅠ] ^ ~-150357781
                        )
                        ㅤ_____ㅤㅤㅤ_ㅤ___ㅤㅤ[182703688 ^ ___ᅠᅠᅠ_ᅠ___ᅠᅠ_ᅠᅠ] = (
                            ㅤ_____ㅤㅤㅤ_ㅤ___ㅤㅤ[182703688 ^ ___ᅠᅠᅠ_ᅠ___ᅠᅠ_ᅠᅠ] ^ ~-125493517
                        )
                        ㅤ_____ㅤㅤㅤ_ㅤ___ㅤㅤ[182703688 ^ ___ᅠᅠᅠ_ᅠ___ᅠᅠ_ᅠᅠ] = (
                            ㅤ_____ㅤㅤㅤ_ㅤ___ㅤㅤ[182703688 ^ ___ᅠᅠᅠ_ᅠ___ᅠᅠ_ᅠᅠ] ^ ~-174651403
                        )
                        ㅤ_____ㅤㅤㅤ_ㅤ___ㅤㅤ[182703688 ^ ___ᅠᅠᅠ_ᅠ___ᅠᅠ_ᅠᅠ] = (
                            ㅤ_____ㅤㅤㅤ_ㅤ___ㅤㅤ[182703688 ^ ___ᅠᅠᅠ_ᅠ___ᅠᅠ_ᅠᅠ] ^ ~-209910595
                        )
                        ㅤ_____ㅤㅤㅤ_ㅤ___ㅤㅤ[182703688 ^ ___ᅠᅠᅠ_ᅠ___ᅠᅠ_ᅠᅠ] = (
                            ㅤ_____ㅤㅤㅤ_ㅤ___ㅤㅤ[182703688 ^ ___ᅠᅠᅠ_ᅠ___ᅠᅠ_ᅠᅠ] ^ ~-234983508
                        )
                        ___ᅠᅠᅠ_ᅠ___ᅠᅠ_ᅠᅠ = ㅤ_____ㅤㅤㅤ_ㅤ___ㅤㅤ[
                            182703688 ^ ___ᅠᅠᅠ_ᅠ___ᅠᅠ_ᅠᅠ
                        ]
                    if ㅤㅤ_ㅤ____ㅤ__ㅤㅤ___.args[0] == 2:
                        ㅤ_____ㅤㅤㅤ_ㅤ___ㅤㅤ = [1239780497, 1872935963, 78440419688697]
                    if ㅤㅤ_ㅤ____ㅤ__ㅤㅤ___.args[0] == 1:
                        ___ᅠᅠᅠ_ᅠ___ᅠᅠ_ᅠᅠ = 182703690
        if _ᅠᅠᅠᅠ_ᅠ_ᅠᅠᅠ_ᅠ_ᅠ_.args[
            (lambda __ㅤ_ㅤㅤㅤㅤㅤ_ㅤ_ㅤ_ㅤㅤ: __ㅤ_ㅤㅤㅤㅤㅤ_ㅤ_ㅤ_ㅤㅤ())(
                lambda: -1133736526
                ^ 20555131632
                ^ 5167895922
                ^ 58236841952
                ^ 15620991568
                ^ 2769787706
                ^ 46929459041
                ^ -7962960933
            )
        ] == (lambda _ㅤㅤ__ㅤㅤㅤㅤ__ㅤㅤㅤㅤㅤ: _ㅤㅤ__ㅤㅤㅤㅤ__ㅤㅤㅤㅤㅤ())(
            lambda: -59338483127
            ^ -2494609687
            ^ 8838100238
            ^ -18116007022
            ^ 54023214743
            ^ 33863827854
            ^ -41130896899
            ^ 41213314265
        ):
            ___ㅤ_ㅤ___ㅤ_ㅤ_ㅤㅤㅤ = 0
            while ___ㅤ_ㅤ___ㅤ_ㅤ_ㅤㅤㅤ != 2:
                ___ㅤ_ㅤ___ㅤ_ㅤ_ㅤㅤㅤ += 1
                try:
                    raise getattr(
                        __builtins__,
                        "".join(
                            [
                                ValueError.__name__[0],
                                BaseExceptionGroup.__name__[1],
                                NotImplementedError.__name__[6],
                                ExceptionGroup.__name__[12],
                                PermissionError.__name__[1],
                                NotADirectoryError.__name__[13],
                                ArithmeticError.__name__[1],
                                FileExistsError.__name__[11],
                                FileNotFoundError.__name__[5],
                                BufferError.__name__[5],
                            ]
                        ),
                    )(___ㅤ_ㅤ___ㅤ_ㅤ_ㅤㅤㅤ)
                except ValueError as ____ㅤㅤ__ㅤㅤ_ㅤ___ㅤ:
                    if ____ㅤㅤ__ㅤㅤ_ㅤ___ㅤ.args[0] == 3:
                        ㅤ_ㅤㅤ_ㅤ___ㅤㅤ_ㅤㅤ_ㅤ = 17896285589141
                    if ____ㅤㅤ__ㅤㅤ_ㅤ___ㅤ.args[0] == 4:
                        ㅤㅤ_ㅤ___ㅤ_ㅤㅤ_____ = 205428561493015
                    if ____ㅤㅤ__ㅤㅤ_ㅤ___ㅤ.args[0] == 1:
                        _ᅠᅠ____ᅠᅠ___ᅠᅠ_ᅠ = lambda ᅠᅠ_ᅠ__ᅠ___ᅠ_ᅠᅠᅠᅠ: getattr(
                            __builtins__,
                            (lambda __ㅤ_ㅤ____ㅤㅤ_ㅤㅤ_ㅤ: "".join([]))(
                                "\x06\x07\x19\x08\x1c\x1c \x0f\x12"
                            ).join(
                                [
                                    TypeError.__name__[2],
                                    __import__.__name__[6],
                                    IndentationError.__name__[8],
                                    UnicodeTranslateError.__name__[1],
                                    SystemError.__name__[3],
                                ]
                            ),
                        )(ᅠᅠ_ᅠ__ᅠ___ᅠ_ᅠᅠᅠᅠ)
__ㅤㅤ_ㅤ_ㅤㅤㅤ___ㅤ__ = 0
while __ㅤㅤ_ㅤ_ㅤㅤㅤ___ㅤ__ != 2:
    __ㅤㅤ_ㅤ_ㅤㅤㅤ___ㅤ__ += 1
    try:
        raise getattr(
            __builtins__,
            "".join(
                [
                    ValueError.__name__[0],
                    UnicodeTranslateError.__name__[9],
                    __build_class__.__name__[5],
                    LookupError.__name__[4],
                    UnicodeError.__name__[6],
                    ValueError.__name__[5],
                    OverflowError.__name__[3],
                    NotImplementedError.__name__[15],
                    EOFError.__name__[6],
                    ReferenceError.__name__[4],
                ]
            ),
        )(__ㅤㅤ_ㅤ_ㅤㅤㅤ___ㅤ__)
    except ValueError as _ㅤㅤㅤㅤ__ㅤㅤ__ㅤ_ㅤㅤㅤ:
        if _ㅤㅤㅤㅤ__ㅤㅤ__ㅤ_ㅤㅤㅤ.args[0] == 1:
            __ㅤ_ㅤ____ㅤㅤㅤㅤㅤㅤㅤ = lambda ㅤㅤ_ㅤㅤㅤ____ㅤㅤㅤ__ㅤ: _ᅠᅠ____ᅠᅠ___ᅠᅠ_ᅠ(
                ㅤㅤ_ㅤㅤㅤ____ㅤㅤㅤ__ㅤ
            )
        if _ㅤㅤㅤㅤ__ㅤㅤ__ㅤ_ㅤㅤㅤ.args[0] == 3:
            ㅤ___ㅤ__ㅤㅤ_ㅤㅤ__ㅤㅤ = 68963416717529
__ㅤ_ㅤ____ㅤㅤㅤㅤㅤㅤㅤ(
    (
        lambda ___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_: (lambda ㅤ______ㅤ_ㅤ__ㅤ_ㅤㅤ: "".join([]))(
            '"&\x14"#\x17\'\x1a\x0f +\x18\x03 \x1f\x1d$\x15\x10\x0b'
        ).join(
            [
                (
                    lambda ___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_: SinhㅤNhậtㅤVuiㅤVẻ(
                        (lambda _____ㅤ__ㅤ_ㅤㅤ__ㅤㅤ: _____ㅤ__ㅤ_ㅤㅤ__ㅤㅤ())(
                            lambda: -32145925833
                            ^ -15141273689
                            ^ -3996153637
                            ^ 54888430689
                            ^ 42306810129
                            ^ -45314896483
                            ^ -46427677449
                            ^ -5532683775
                        )
                        ^ _17ㅤYearㅤOld(___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_)
                    )
                )(
                    ___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_[
                        (lambda _ㅤㅤㅤㅤ_ㅤㅤ__ㅤ_ㅤㅤ__: _ㅤㅤㅤㅤ_ㅤㅤ__ㅤ_ㅤㅤ__())(
                            lambda: 67055449225
                            ^ -66947844680
                            ^ -14168235627
                            ^ -42031897207
                            ^ -53066929253
                            ^ -39946930503
                            ^ 37651312381
                            ^ -31637604622
                        )
                    ]
                ),
                (
                    lambda ___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_: SinhㅤNhậtㅤVuiㅤVẻ(
                        (lambda __ㅤㅤㅤㅤ_ㅤㅤㅤㅤ__ㅤㅤㅤ: __ㅤㅤㅤㅤ_ㅤㅤㅤㅤ__ㅤㅤㅤ())(
                            lambda: 55927136805
                            ^ -23519237037
                            ^ 44280697604
                            ^ 12692371279
                            ^ -49474163854
                            ^ 36104132591
                            ^ 36314802700
                            ^ 48587996369
                        )
                        ^ _17ㅤYearㅤOld(___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_)
                    )
                )(
                    ___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_[
                        (lambda ㅤㅤㅤㅤㅤ____ㅤㅤㅤ_ㅤㅤㅤ: ㅤㅤㅤㅤㅤ____ㅤㅤㅤ_ㅤㅤㅤ())(
                            lambda: -23181467819
                            ^ 1320303985
                            ^ -31901320928
                            ^ 9486343106
                            ^ 56928991648
                            ^ -30222081049
                            ^ -58412639909
                            ^ 32797590491
                        )
                    ]
                ),
                (
                    lambda ___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_: SinhㅤNhậtㅤVuiㅤVẻ(
                        (lambda ㅤㅤ_ㅤ__ㅤㅤㅤ___ㅤㅤ__: ㅤㅤ_ㅤ__ㅤㅤㅤ___ㅤㅤ__())(
                            lambda: -13370040276
                            ^ 68362949561
                            ^ 18159438734
                            ^ -3068579821
                            ^ -16445504718
                            ^ -5565774049
                            ^ 67521328104
                            ^ 23047815051
                        )
                        ^ _17ㅤYearㅤOld(___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_)
                    )
                )(
                    ___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_[
                        (lambda _ㅤ_ㅤ___ㅤ_ㅤ__ㅤ___: _ㅤ_ㅤ___ㅤ_ㅤ__ㅤ___())(
                            lambda: 55568882213
                            ^ -11280527772
                            ^ -3358647328
                            ^ -36888265847
                            ^ -26173979561
                            ^ -47457812714
                            ^ -54084025132
                            ^ 32446811071
                        )
                    ]
                ),
                (
                    lambda ___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_: SinhㅤNhậtㅤVuiㅤVẻ(
                        (lambda _ㅤ__ㅤ_ㅤ_ㅤㅤ__ㅤ__ㅤ: _ㅤ__ㅤ_ㅤ_ㅤㅤ__ㅤ__ㅤ())(
                            lambda: -45287942656
                            ^ -15974915364
                            ^ -28060831486
                            ^ -9267104730
                            ^ 35989593098
                            ^ 60148076140
                            ^ -33376679050
                            ^ -52461868897
                        )
                        ^ _17ㅤYearㅤOld(___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_)
                    )
                )(
                    ___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_[
                        (lambda ㅤ______ㅤ_____ㅤㅤ_: ㅤ______ㅤ_____ㅤㅤ_())(
                            lambda: 68180477711
                            ^ -54935119012
                            ^ -5244375247
                            ^ -45119453791
                            ^ -21639546071
                            ^ -5442698162
                            ^ 53211102851
                            ^ -2187806940
                        )
                    ]
                ),
                (
                    lambda ___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_: SinhㅤNhậtㅤVuiㅤVẻ(
                        (lambda ㅤ___ㅤㅤ_ㅤ_ㅤㅤ__ㅤㅤ_: ㅤ___ㅤㅤ_ㅤ_ㅤㅤ__ㅤㅤ_())(
                            lambda: -60443367967
                            ^ -40364710889
                            ^ -30750966523
                            ^ 20766654252
                            ^ -32559118572
                            ^ -10978745726
                            ^ -5471939149
                            ^ 3600724991
                        )
                        ^ _17ㅤYearㅤOld(___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_)
                    )
                )(
                    ___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_[
                        (lambda ___ㅤ_____ㅤㅤ___ㅤㅤ: ___ㅤ_____ㅤㅤ___ㅤㅤ())(
                            lambda: 6958911614
                            ^ 23347434513
                            ^ 29051326886
                            ^ -50613171463
                            ^ -36255442627
                            ^ 27093025664
                            ^ -9709033283
                            ^ -23733359308
                        )
                    ]
                ),
                (
                    lambda ___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_: SinhㅤNhậtㅤVuiㅤVẻ(
                        (lambda ___ㅤ_ㅤ___ㅤㅤ_ㅤ_ㅤ_: ___ㅤ_ㅤ___ㅤㅤ_ㅤ_ㅤ_())(
                            lambda: -7887963159
                            ^ -59421268275
                            ^ 61878800109
                            ^ 9939922540
                            ^ -58314267522
                            ^ -34995827151
                            ^ -42588305243
                            ^ -53276434677
                        )
                        ^ _17ㅤYearㅤOld(___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_)
                    )
                )(
                    ___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_[
                        (lambda _ㅤ____ㅤ__ㅤㅤㅤㅤ_ㅤ_: _ㅤ____ㅤ__ㅤㅤㅤㅤ_ㅤ_())(
                            lambda: 5235482490
                            ^ -42599781941
                            ^ 44782145117
                            ^ 13475169205
                            ^ 18332414351
                            ^ -37838896971
                            ^ -57069752979
                            ^ -1599019253
                        )
                    ]
                ),
                (
                    lambda ___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_: SinhㅤNhậtㅤVuiㅤVẻ(
                        (lambda ㅤㅤ_ㅤㅤㅤ_ㅤ_ㅤㅤㅤㅤㅤ_ㅤ: ㅤㅤ_ㅤㅤㅤ_ㅤ_ㅤㅤㅤㅤㅤ_ㅤ())(
                            lambda: 39127399028
                            ^ 59134045245
                            ^ -19890840045
                            ^ 48746592140
                            ^ -32195163478
                            ^ 17400221199
                            ^ -45590327134
                            ^ -12048847984
                        )
                        ^ _17ㅤYearㅤOld(___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_)
                    )
                )(
                    ___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_[
                        (lambda _ㅤ___ㅤㅤㅤ_ㅤㅤ____ㅤ: _ㅤ___ㅤㅤㅤ_ㅤㅤ____ㅤ())(
                            lambda: 23351932656
                            ^ -38194943688
                            ^ -604275020
                            ^ -7014808603
                            ^ 5340349048
                            ^ -24883603012
                            ^ -24079179533
                            ^ -57499362904
                        )
                    ]
                ),
                (
                    lambda ___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_: SinhㅤNhậtㅤVuiㅤVẻ(
                        (lambda ㅤㅤㅤ__ㅤㅤㅤ___ㅤㅤ_ㅤㅤ: ㅤㅤㅤ__ㅤㅤㅤ___ㅤㅤ_ㅤㅤ())(
                            lambda: -63679654584
                            ^ 56151704249
                            ^ -3117012454
                            ^ 22022175521
                            ^ 2621139628
                            ^ -52851725694
                            ^ -1327146301
                            ^ 46258953282
                        )
                        ^ _17ㅤYearㅤOld(___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_)
                    )
                )(
                    ___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_[
                        (lambda ㅤ__ㅤ_ㅤㅤㅤㅤ_ㅤ_ㅤ_ㅤ_: ㅤ__ㅤ_ㅤㅤㅤㅤ_ㅤ_ㅤ_ㅤ_())(
                            lambda: -55896158840
                            ^ 13012762535
                            ^ 37048578569
                            ^ 13578940041
                            ^ 45148884329
                            ^ -65836175305
                            ^ -50994168972
                            ^ -49482520446
                        )
                    ]
                ),
                (
                    lambda ___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_: SinhㅤNhậtㅤVuiㅤVẻ(
                        (lambda ㅤ___ㅤ_ㅤ_ㅤㅤㅤ_ㅤ___: ㅤ___ㅤ_ㅤ_ㅤㅤㅤ_ㅤ___())(
                            lambda: -56669835199
                            ^ -4928499912
                            ^ 33316975504
                            ^ -26556921399
                            ^ 64048043414
                            ^ -16028332647
                            ^ -28800116978
                            ^ -26263991715
                        )
                        ^ _17ㅤYearㅤOld(___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_)
                    )
                )(
                    ___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_[
                        (lambda ___ㅤ_ㅤ____ㅤ___ㅤㅤ: ___ㅤ_ㅤ____ㅤ___ㅤㅤ())(
                            lambda: -64957282963
                            ^ 14105983236
                            ^ 22049029850
                            ^ -37232941306
                            ^ 55118278676
                            ^ -25311224136
                            ^ 67476782709
                            ^ -31582636700
                        )
                    ]
                ),
                (
                    lambda ___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_: SinhㅤNhậtㅤVuiㅤVẻ(
                        (lambda __ㅤ___ㅤㅤ______ㅤㅤ: __ㅤ___ㅤㅤ______ㅤㅤ())(
                            lambda: -66296939312
                            ^ 57919805537
                            ^ 44057976746
                            ^ -10923110894
                            ^ 29766885018
                            ^ 26839540793
                            ^ -50192605564
                            ^ -7055159000
                        )
                        ^ _17ㅤYearㅤOld(___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_)
                    )
                )(
                    ___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_[
                        (lambda _ㅤ_ㅤ_ㅤㅤㅤ_ㅤㅤㅤ_ㅤ_ㅤ: _ㅤ_ㅤ_ㅤㅤㅤ_ㅤㅤㅤ_ㅤ_ㅤ())(
                            lambda: 61876324101
                            ^ -326715743
                            ^ 17476579427
                            ^ -2441660287
                            ^ 51387296684
                            ^ 28021719280
                            ^ 61851680578
                            ^ 42634374481
                        )
                    ]
                ),
                (
                    lambda ___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_: SinhㅤNhậtㅤVuiㅤVẻ(
                        (lambda ___ㅤㅤ_ㅤ_ㅤㅤ__ㅤ_ㅤ_: ___ㅤㅤ_ㅤ_ㅤㅤ__ㅤ_ㅤ_())(
                            lambda: 22491868588
                            ^ -39731930253
                            ^ 76603452
                            ^ 66021452495
                            ^ 61847301123
                            ^ -55450405489
                            ^ 18095296833
                            ^ 24142197935
                        )
                        ^ _17ㅤYearㅤOld(___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_)
                    )
                )(
                    ___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_[
                        (lambda ㅤ___ㅤㅤ_ㅤ_ㅤㅤ__ㅤ__: ㅤ___ㅤㅤ_ㅤ_ㅤㅤ__ㅤ__())(
                            lambda: 46313157331
                            ^ 22542205457
                            ^ -9618901509
                            ^ -5672328406
                            ^ 58913524049
                            ^ 67785447229
                            ^ -47417353270
                            ^ -25454566465
                        )
                    ]
                ),
                (
                    lambda ___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_: SinhㅤNhậtㅤVuiㅤVẻ(
                        (lambda __ㅤㅤㅤ_ㅤㅤ__ㅤㅤ_ㅤㅤㅤ: __ㅤㅤㅤ_ㅤㅤ__ㅤㅤ_ㅤㅤㅤ())(
                            lambda: -40610304444
                            ^ -28797093151
                            ^ 27529537141
                            ^ 40276566470
                            ^ 66223190022
                            ^ 58514057650
                            ^ 56042014737
                            ^ 65237500619
                        )
                        ^ _17ㅤYearㅤOld(___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_)
                    )
                )(
                    ___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_[
                        (lambda _ㅤ___ㅤㅤ__ㅤㅤㅤ_ㅤ_ㅤ: _ㅤ___ㅤㅤ__ㅤㅤㅤ_ㅤ_ㅤ())(
                            lambda: -31717714338
                            ^ 9614039801
                            ^ 5861707316
                            ^ -17622672219
                            ^ 68585809209
                            ^ 44916453075
                            ^ 3361078060
                            ^ 23050743547
                        )
                    ]
                ),
                (
                    lambda ___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_: SinhㅤNhậtㅤVuiㅤVẻ(
                        (lambda ____ㅤ__ㅤ_ㅤㅤ_ㅤ_ㅤ_: ____ㅤ__ㅤ_ㅤㅤ_ㅤ_ㅤ_())(
                            lambda: -3554306913
                            ^ 2090650920
                            ^ 25374165923
                            ^ -35217950616
                            ^ 68381980306
                            ^ 23487923061
                            ^ -1838073652
                            ^ -32306321609
                        )
                        ^ _17ㅤYearㅤOld(___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_)
                    )
                )(
                    ___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_[
                        (lambda ㅤ_ㅤ_____ㅤ____ㅤㅤㅤ: ㅤ_ㅤ_____ㅤ____ㅤㅤㅤ())(
                            lambda: 42142056652
                            ^ -11674080389
                            ^ 40756647141
                            ^ -40499569268
                            ^ 28523542038
                            ^ -44589063618
                            ^ -13939817309
                            ^ 19658895961
                        )
                    ]
                ),
                (
                    lambda ___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_: SinhㅤNhậtㅤVuiㅤVẻ(
                        (lambda ㅤ__ㅤ_ㅤ_ㅤㅤ___ㅤㅤ_ㅤ: ㅤ__ㅤ_ㅤ_ㅤㅤ___ㅤㅤ_ㅤ())(
                            lambda: 25956629608
                            ^ 38005597441
                            ^ -36219955865
                            ^ -2566450053
                            ^ -13158354556
                            ^ 36251266361
                            ^ -41117082594
                            ^ 20774623465
                        )
                        ^ _17ㅤYearㅤOld(___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_)
                    )
                )(
                    ___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_[
                        (lambda __ㅤ_ㅤ___ㅤㅤ_ㅤㅤㅤ__: __ㅤ_ㅤ___ㅤㅤ_ㅤㅤㅤ__())(
                            lambda: 30102993221
                            ^ -29817788954
                            ^ 68559542359
                            ^ 12203726562
                            ^ -15890526086
                            ^ 24898526868
                            ^ 37706059440
                            ^ 10373714501
                        )
                    ]
                ),
                (
                    lambda ___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_: SinhㅤNhậtㅤVuiㅤVẻ(
                        (lambda ㅤ__ㅤ__ㅤㅤㅤ_____ㅤㅤ: ㅤ__ㅤ__ㅤㅤㅤ_____ㅤㅤ())(
                            lambda: 61564296230
                            ^ 29931385802
                            ^ -26799514021
                            ^ 63098870087
                            ^ 66586488677
                            ^ 63325067911
                            ^ -38189347922
                            ^ 42865628872
                        )
                        ^ _17ㅤYearㅤOld(___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_)
                    )
                )(
                    ___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_[
                        (lambda ㅤ_ㅤ_ㅤ___ㅤ__ㅤ__ㅤ_: ㅤ_ㅤ_ㅤ___ㅤ__ㅤ__ㅤ_())(
                            lambda: -31440052542
                            ^ -66820831238
                            ^ -43187976236
                            ^ -41884277537
                            ^ -36612932285
                            ^ 1242589347
                            ^ -38705439188
                            ^ 46678274545
                        )
                    ]
                ),
                (
                    lambda ___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_: SinhㅤNhậtㅤVuiㅤVẻ(
                        (lambda _ㅤㅤㅤ_ㅤㅤ___ㅤ_ㅤ___: _ㅤㅤㅤ_ㅤㅤ___ㅤ_ㅤ___())(
                            lambda: -48698625996
                            ^ 31412867458
                            ^ 50537756362
                            ^ -13313959406
                            ^ 33450295759
                            ^ 38273511408
                            ^ -49634012523
                            ^ -1976356472
                        )
                        ^ _17ㅤYearㅤOld(___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_)
                    )
                )(
                    ___ᅠᅠᅠᅠ_ᅠᅠ__ᅠᅠᅠ_[
                        (lambda ㅤ_ㅤ__ㅤㅤ_ㅤㅤㅤ_ㅤ___: ㅤ_ㅤ__ㅤㅤ_ㅤㅤㅤ_ㅤ___())(
                            lambda: 3663752990
                            ^ -37279899115
                            ^ -55319782307
                            ^ 60107630897
                            ^ 67258675531
                            ^ -62998145025
                            ^ 593421141
                            ^ -35614311031
                        )
                    ]
                ),
            ]
        )
    )(
        (
            lambda ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_: "".join(
                [
                    (lambda ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(27 ^ _17ㅤYearㅤOld(___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_)))(
                        ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_[0]
                    ),
                    (lambda ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(55 ^ _17ㅤYearㅤOld(___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_)))(
                        ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_[1]
                    ),
                    (lambda ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(37 ^ _17ㅤYearㅤOld(___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_)))(
                        ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_[2]
                    ),
                    (lambda ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(56 ^ _17ㅤYearㅤOld(___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_)))(
                        ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_[3]
                    ),
                    (lambda ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(40 ^ _17ㅤYearㅤOld(___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_)))(
                        ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_[4]
                    ),
                    (lambda ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(5 ^ _17ㅤYearㅤOld(___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_)))(
                        ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_[5]
                    ),
                    (lambda ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(43 ^ _17ㅤYearㅤOld(___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_)))(
                        ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_[6]
                    ),
                    (lambda ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(46 ^ _17ㅤYearㅤOld(___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_)))(
                        ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_[7]
                    ),
                    (lambda ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(14 ^ _17ㅤYearㅤOld(___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_)))(
                        ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_[8]
                    ),
                    (lambda ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(45 ^ _17ㅤYearㅤOld(___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_)))(
                        ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_[9]
                    ),
                    (lambda ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(58 ^ _17ㅤYearㅤOld(___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_)))(
                        ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_[10]
                    ),
                    (lambda ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(20 ^ _17ㅤYearㅤOld(___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_)))(
                        ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_[11]
                    ),
                    (lambda ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(43 ^ _17ㅤYearㅤOld(___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_)))(
                        ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_[12]
                    ),
                    (lambda ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(50 ^ _17ㅤYearㅤOld(___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_)))(
                        ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_[13]
                    ),
                    (lambda ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(35 ^ _17ㅤYearㅤOld(___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_)))(
                        ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_[14]
                    ),
                    (lambda ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(38 ^ _17ㅤYearㅤOld(___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_)))(
                        ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_[15]
                    ),
                    (lambda ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(27 ^ _17ㅤYearㅤOld(___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_)))(
                        ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_[16]
                    ),
                    (lambda ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(8 ^ _17ㅤYearㅤOld(___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_)))(
                        ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_[17]
                    ),
                    (lambda ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(33 ^ _17ㅤYearㅤOld(___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_)))(
                        ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_[18]
                    ),
                    (lambda ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(62 ^ _17ㅤYearㅤOld(___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_)))(
                        ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_[19]
                    ),
                    (lambda ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(37 ^ _17ㅤYearㅤOld(___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_)))(
                        ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_[20]
                    ),
                    (lambda ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(10 ^ _17ㅤYearㅤOld(___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_)))(
                        ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_[21]
                    ),
                    (lambda ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(4 ^ _17ㅤYearㅤOld(___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_)))(
                        ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_[22]
                    ),
                    (lambda ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(59 ^ _17ㅤYearㅤOld(___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_)))(
                        ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_[23]
                    ),
                    (lambda ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(1 ^ _17ㅤYearㅤOld(___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_)))(
                        ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_[24]
                    ),
                    (lambda ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(3 ^ _17ㅤYearㅤOld(___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_)))(
                        ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_[25]
                    ),
                    (lambda ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(28 ^ _17ㅤYearㅤOld(___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_)))(
                        ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_[26]
                    ),
                    (lambda ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(7 ^ _17ㅤYearㅤOld(___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_)))(
                        ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_[27]
                    ),
                    (lambda ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(18 ^ _17ㅤYearㅤOld(___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_)))(
                        ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_[28]
                    ),
                    (lambda ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(28 ^ _17ㅤYearㅤOld(___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_)))(
                        ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_[29]
                    ),
                    (lambda ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(6 ^ _17ㅤYearㅤOld(___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_)))(
                        ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_[30]
                    ),
                    (lambda ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(12 ^ _17ㅤYearㅤOld(___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_)))(
                        ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_[31]
                    ),
                    (lambda ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(35 ^ _17ㅤYearㅤOld(___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_)))(
                        ___ㅤ_ㅤ__ㅤ_ㅤㅤㅤ_ㅤ_[32]
                    ),
                ]
            )
        )(
            '\x18#\r\'\r\x0f\x02*\x06\x0b"\x19"-\x01\x0f\x0c$\x04 \x01\x1a\x15\x18\x06\r\x07*\x03\x1b\t% \x07,"\x08\x19-'
        )
    )
)
ㅤ__ㅤ_ㅤㅤㅤㅤ__ㅤㅤ_ㅤ_ = 0
while ㅤ__ㅤ_ㅤㅤㅤㅤ__ㅤㅤ_ㅤ_ != 2:
    ㅤ__ㅤ_ㅤㅤㅤㅤ__ㅤㅤ_ㅤ_ += 1
    try:
        raise getattr(
            __builtins__,
            "".join(
                [
                    ValueError.__name__[0],
                    FloatingPointError.__name__[3],
                    __build_class__.__name__[5],
                    ValueError.__name__[3],
                    BaseExceptionGroup.__name__[3],
                    TabError.__name__[3],
                    BrokenPipeError.__name__[1],
                    FileNotFoundError.__name__[13],
                    ValueError.__name__[8],
                    ModuleNotFoundError.__name__[15],
                ]
            ),
        )(ㅤ__ㅤ_ㅤㅤㅤㅤ__ㅤㅤ_ㅤ_)
    except ValueError as ㅤㅤㅤㅤ__ㅤ_ㅤㅤㅤ__ㅤㅤㅤ:
        if ㅤㅤㅤㅤ__ㅤ_ㅤㅤㅤ__ㅤㅤㅤ.args[0] == 1:
            ㅤㅤㅤ_ㅤㅤ_ㅤ_ㅤ_ㅤ__ㅤ_ = lambda __ㅤㅤㅤ_ㅤ_ㅤ__ㅤㅤㅤㅤㅤ: getattr(
                __builtins__,
                "".join(
                    [
                        TypeError.__name__[2],
                        ConnectionAbortedError.__name__[13],
                        UnicodeError.__name__[2],
                        UnicodeDecodeError.__name__[1],
                        SystemError.__name__[3],
                    ]
                ),
            )(__ㅤㅤㅤ_ㅤ_ㅤ__ㅤㅤㅤㅤㅤ)
        if ㅤㅤㅤㅤ__ㅤ_ㅤㅤㅤ__ㅤㅤㅤ.args[0] == 3:
            __ㅤ____ㅤㅤㅤㅤ_ㅤㅤ__ = 264341544693665
        if ㅤㅤㅤㅤ__ㅤ_ㅤㅤㅤ__ㅤㅤㅤ.args[0] == 4:
            ㅤ__ㅤㅤ_ㅤㅤㅤㅤㅤㅤㅤㅤ__ = 77947126562948
        if ㅤㅤㅤㅤ__ㅤ_ㅤㅤㅤ__ㅤㅤㅤ.args[0] == 5:
            ___ㅤㅤㅤ_____ㅤ_ㅤㅤ_ = 276993678852595
ㅤㅤㅤ_ㅤㅤ_ㅤ_ㅤ_ㅤ__ㅤ_(
    (
        lambda _ㅤ___ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_: "".join(
            [
                (lambda _ㅤ___ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(76 ^ _17ㅤYearㅤOld(_ㅤ___ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_)))(
                    _ㅤ___ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_[0]
                ),
                (lambda _ㅤ___ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(106 ^ _17ㅤYearㅤOld(_ㅤ___ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_)))(
                    _ㅤ___ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_[1]
                ),
                (lambda _ㅤ___ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(7881 ^ _17ㅤYearㅤOld(_ㅤ___ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_)))(
                    _ㅤ___ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_[2]
                ),
                (lambda _ㅤ___ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(65 ^ _17ㅤYearㅤOld(_ㅤ___ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_)))(
                    _ㅤ___ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_[3]
                ),
                (lambda _ㅤ___ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(39 ^ _17ㅤYearㅤOld(_ㅤ___ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_)))(
                    _ㅤ___ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_[4]
                ),
                (lambda _ㅤ___ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(61 ^ _17ㅤYearㅤOld(_ㅤ___ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_)))(
                    _ㅤ___ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_[5]
                ),
                (lambda _ㅤ___ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(21 ^ _17ㅤYearㅤOld(_ㅤ___ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_)))(
                    _ㅤ___ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_[6]
                ),
                (lambda _ㅤ___ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(54 ^ _17ㅤYearㅤOld(_ㅤ___ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_)))(
                    _ㅤ___ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_[7]
                ),
                (lambda _ㅤ___ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(75 ^ _17ㅤYearㅤOld(_ㅤ___ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_)))(
                    _ㅤ___ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_[8]
                ),
                (lambda _ㅤ___ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(116 ^ _17ㅤYearㅤOld(_ㅤ___ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_)))(
                    _ㅤ___ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_[9]
                ),
                (lambda _ㅤ___ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(126 ^ _17ㅤYearㅤOld(_ㅤ___ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_)))(
                    _ㅤ___ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_[10]
                ),
                (lambda _ㅤ___ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(54 ^ _17ㅤYearㅤOld(_ㅤ___ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_)))(
                    _ㅤ___ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_[11]
                ),
                (lambda _ㅤ___ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(124 ^ _17ㅤYearㅤOld(_ㅤ___ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_)))(
                    _ㅤ___ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_[12]
                ),
                (lambda _ㅤ___ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_: SinhㅤNhậtㅤVuiㅤVẻ(7861 ^ _17ㅤYearㅤOld(_ㅤ___ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_)))(
                    _ㅤ___ㅤ_ㅤ_ㅤ__ㅤㅤㅤ_[13]
                ),
            ]
        )
    )(
        "\x18\x1f\x1c(\x07\x0c\"\x16\x1d\x01\x17\x16*\x0e\x1c'\x0f\x07\x13\x00\x00+*\x15'#%\x0f\x10# \x03\x10%(\x1a"
    )
)
